ezois_ka/oooezoiskaobmen/src/Documents/УведомлениеОСтатусеВыплатыПособия/УведомлениеОСтатусеВыплатыПособия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОСтатусеВыплатыПособия</name>
  <comment>Типы СЭДО 110, 11000, 11010.</comment>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСообщения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Загружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПодтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиПодтверждения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждениеПолученоСФР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникФамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникСНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПроцесса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыплатыПоТегам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыплатыСсылка</name>
    <type>
      <types>EnumRef.СтатусыВыплатыПособия</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПособияЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пояснения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховательНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Начислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выплачено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удержано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяОбработать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ФиксацияИзменений</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НеобработанныеУзлы</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеСодержимого</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/СНИЛСВходящихСообщенийСЭДО/СНИЛСВходящихСообщенийСЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СНИЛСВходящихСообщенийСЭДО</name>
  <comment>Не все документы, а только те, которые свидетельствуют о наличии привязки СНИЛС к страхователю - 100 и 111.</comment>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </resources>
  <resources>
    <name>ВходящийДокумент</name>
    <type>
      <types>DefinedType.ВходящиеДокументыСЭДОФСС</types>
    </type>
  </resources>
  <resources>
    <name>ВходящаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерЛН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/РегистрацииОтветовНаЗапросыФССДляРасчетаПособий/РегистрацииОтветовНаЗапросыФССДляРасчетаПособий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрацииОтветовНаЗапросыФССДляРасчетаПособий</name>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументаСЭДОФСС</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДоставкаИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоставкаТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Зарегистрирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрацияНомерПроцесса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрацияНомерРеестра</name>
    <comment>Пример: P_1234567890_2022_01_01_12345678_0</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрацияСтатус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕстьОшибкиЛогическогоКонтроля</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьРегистрацияНомерРеестраПВСО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтправленОператору</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправкиОператору</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДоставкаИдентификаторПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыплатаСсылка</name>
    <type>
      <types>DocumentRef.УведомлениеОСтатусеВыплатыПособия</types>
    </type>
  </resources>
  <resources>
    <name>ВыплатаСтатус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыплатаУспех</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлениеОбИзменении</name>
    <type>
      <types>DocumentRef.УведомлениеОбИзмененииРасчетаПособия</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистрацияПротокол</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиЛогическогоКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИсходящийДокумент</name>
    <type>
      <types>DocumentRef.ОтветНаЗапросФССДляРасчетаПособия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Documents/УведомлениеОСтатусеВыплатыПособия/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДата(); // АПК:143 Для фильтрации событий в журнале регистрации требуется дата сервера.
	КонецЕсли;
	ЗаполнитьИдентификаторРеестра();
	ЗаполнитьСсылкуСтатусаВыплаты();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Загружен Тогда
		ФИО = СокрП(СотрудникФамилия + " " + СотрудникИмя + " " + СотрудникОтчество);
		РегистрыСведений.СНИЛСВходящихСообщенийСЭДО.ОбновитьПоДокументу(
			Ссылка,
			Страхователь,
			ИдентификаторСообщения,
			СотрудникСНИЛС,
			ФизическоеЛицо,
			ДатаСообщения,
			ФИО,
			Менеджер().ТипСообщения(ЭтотОбъект));
	КонецЕсли;
	
	РегистрыСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий.ПриЗаписиУведомленияОСтатусеВыплатыПособия(
		ЭтотОбъект);
	РегистрыСведений.РегистрацииЗаявленийОВозмещенииВыплатРодителямДетейИнвалидов.ПриЗаписиУведомленияОСтатусеВыплатыПособия(
		ЭтотОбъект);
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	РегистрыСведений.СНИЛСВходящихСообщенийСЭДО.ПриУдаленииДокумента(Страхователь, ИдентификаторСообщения);
	РегистрыСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий.ПриЗаписиУведомленияОСтатусеВыплатыПособия(
		ЭтотОбъект, Истина);
	РегистрыСведений.РегистрацииЗаявленийОВозмещенииВыплатРодителямДетейИнвалидов.ПриЗаписиУведомленияОСтатусеВыплатыПособия(
		ЭтотОбъект, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФиксацияВторичныхДанныхВДокументах

Функция ОбновитьВторичныеДанные(ПараметрыФиксации = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Страхователь);
	Модифицирован = Ложь;
	
	Если ОбъектЗафиксирован() Тогда
		Возврат Модифицирован;
	КонецЕсли;
	
	Если ПараметрыФиксации = Неопределено Тогда
		ПараметрыФиксации = Менеджер().ПараметрыФиксацииВторичныхДанных();
	КонецЕсли;
	
	Если ЗаполнитьИдентификаторРеестра() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьСсылкуСтатусаВыплаты() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьНаОснованииСвязанныхДокументов(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьПодтверждениеПолучения(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьМаксимальнуюДатуПодтвержденияПолучения(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьФизическоеЛицо() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Возврат Модифицирован;
КонецФункции

Функция Менеджер()
	Возврат Документы.УведомлениеОСтатусеВыплатыПособия;
КонецФункции

Функция ОбъектЗафиксирован() Экспорт
	Возврат Менеджер().ОбъектЗафиксирован(ЭтотОбъект);
КонецФункции

Функция ЗаполнитьИдентификаторРеестра()
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(
		ИдентификаторРеестра,
		Документы.УведомлениеОСтатусеВыплатыПособия.ИдентификаторРеестра(ИдентификаторСтрокиРеестра));
КонецФункции

Функция ЗаполнитьСсылкуСтатусаВыплаты()
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(
		СтатусВыплатыСсылка,
		Перечисления.СтатусыВыплатыПособия.СсылкаИзЧисла(СтатусВыплаты));
КонецФункции

Функция ЗаполнитьНаОснованииСвязанныхДокументов(ПараметрыФиксации)
	Если ТипСообщения <> 11010 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЕстьИзменения = Ложь;
	СвязанныеДокументы = Менеджер().СвязанныеДокументы(ЭтотОбъект);
	СсылкаЗаявления = Неопределено;
	
	Если ТипЗнч(СвязанныеДокументы.ИсходящийДокументПоИдентификаторуРеестра) = Тип("ДокументСсылка.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов")
		И ЗначениеЗаполнено(СвязанныеДокументы.ИсходящийДокументПоИдентификаторуРеестра) Тогда
		СсылкаЗаявления = СвязанныеДокументы.ИсходящийДокументПоИдентификаторуРеестра;
	ИначеЕсли ТипЗнч(СвязанныеДокументы.ВходящийДокументПоНомеруПроцесса) = Тип("ДокументСсылка.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов")
		И ЗначениеЗаполнено(СвязанныеДокументы.ВходящийДокументПоНомеруПроцесса) Тогда
		СсылкаЗаявления = СвязанныеДокументы.ВходящийДокументПоНомеруПроцесса;
	КонецЕсли;
	Если СсылкаЗаявления <> Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Оплаты.СотрудникФамилия КАК СотрудникФамилия,
		|	Оплаты.СотрудникИмя КАК СотрудникИмя,
		|	Оплаты.СотрудникОтчество КАК СотрудникОтчество,
		|	Оплаты.СотрудникСНИЛС КАК СотрудникСНИЛС,
		|	Оплаты.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Оплаты КАК Оплаты
		|ГДЕ
		|	Оплаты.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", СсылкаЗаявления);
		
		Таблица = Запрос.Выполнить().Выгрузить();
		Если Таблица.Количество() = 1 Тогда
			СтрокаТаблицы = Таблица[0];
			Реквизиты = Новый Структура("СотрудникФамилия, СотрудникИмя, СотрудникОтчество, СотрудникСНИЛС, ФизическоеЛицо");
			ЗаполнитьЗначенияСвойств(Реквизиты, СтрокаТаблицы);
			Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации) Тогда
				ЕстьИзменения = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьИзменения;
КонецФункции

Функция ЗаполнитьПодтверждениеПолучения(ПараметрыФиксации) Экспорт
	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Реквизиты = Новый Структура("ДатаОтправкиПодтверждения, ПодтверждениеПолученоСФР");
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитыШапкиЗафиксированы(ЭтотОбъект, Реквизиты) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Подтверждение = СЭДОФСС.СостояниеПодтверждения(Страхователь, ИдентификаторСообщения, ДатаОтправкиПодтверждения);
	Если Подтверждение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Реквизиты.ДатаОтправкиПодтверждения = Подтверждение.ДатаОтправки;
	Реквизиты.ПодтверждениеПолученоСФР  = Подтверждение.Доставлено;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЗаполнитьМаксимальнуюДатуПодтвержденияПолучения(ПараметрыФиксации)
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "МаксимальнаяДатаПодтверждения") Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаСообщения) Тогда
		Возврат Ложь;
	КонецЕсли;
	Реквизиты = Новый Структура("МаксимальнаяДатаПодтверждения");
	Если ТребуетсяПодтверждение Тогда
		Реквизиты.МаксимальнаяДатаПодтверждения = Менеджер().МаксимальнаяДатаПодтвержденияПолучения(ЭтотОбъект);
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЗаполнитьФизическоеЛицо()
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "ФизическоеЛицо") Тогда
		Возврат Ложь;
	КонецЕсли;
	ФизическоеЛицоДоИзменения = ФизическоеЛицо;
	ФизическоеЛицо = ФизическиеЛицаЗарплатаКадры.ФизическоеЛицоПоСНИЛСИлиФИО(СотрудникСНИЛС, "", "", "").ФизическоеЛицо;
	Возврат ФизическоеЛицо <> ФизическоеЛицоДоИзменения;
КонецФункции

Функция ЗаполнитьФлажокТребуетсяОбработать() Экспорт
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "ТребуетсяОбработать") Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаСообщения) Тогда
		Возврат Ложь;
	КонецЕсли;
	ТребуетсяОбработатьДоИзменения = ТребуетсяОбработать;
	ТребуетсяОбработать = ТребуетсяОбработать();
	Возврат ТребуетсяОбработать <> ТребуетсяОбработатьДоИзменения;
КонецФункции

Функция ТребуетсяОбработать()
	// Требуется обрабатывать статус "4. Оплата не прошла, от банка получен отказ".
	// Остальные статусы либо не требуют внимания (присылаются справочно),
	// либо сопровождаются другими электронными уведомлениями.
	Если СтатусВыплаты <> 4 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Исторические уведомления создаваемые обработчиком обновления обрабатывать не требуется.
	Если ОбновлениеИнформационнойБазы.ЭтоВызовИзОбработчикаОбновления()
		И ДатаСообщения <= НачалоДня(ДобавитьМесяц(ТекущаяДатаСеанса(), -1)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина; // Требуется обработать.
КонецФункции

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
